# updated system packages
brew "bash"
brew "git"
brew "grep"
brew "less"
brew "zsh"

# linters
brew "hadolint"
brew "jsonlint"
brew "markdownlint-cli"
brew "shellcheck"
brew "vale"
brew "yamllint"

# formatters
brew "shellharden"
brew "shfmt"
brew "stylua"

# lsp
brew "bash-language-server"
brew "docker-ls"
brew "efm-langserver"
brew "kotlin-language-server"
brew "lua-language-server"
brew "marksman"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yaml-language-server"

# extra packages
brew "bat"
brew "coreutils"
brew "fd"
brew "fish"
brew "fisher"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "jq"
brew "lsd"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tree"
brew "wget"
brew "zoxide"

# casks
cask "keepingyouawake"
cask "rectangle"
cask "wez/wezterm/wezterm"
