# updated system packages
brew "bash"
brew "git"
brew "grep"
brew "less"
brew "ruby"
brew "vim"
brew "zsh"

# linters
brew "hadolint"
brew "jsonlint"
brew "markdownlint-cli"
brew "shellcheck"
brew "vale"
brew "yamllint"

# formatters
brew "shellharden"
brew "shfmt"
brew "stylua"

# lsp
brew "efm-langserver"

# extra packages
brew "bat"
brew "coreutils"
brew "fasd"
brew "fd"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "jq"
brew "lsd"
brew "neovim"
brew "railwaycat/emacsmacport/emacs-mac"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "zplug"

# casks
cask "alacritty"
cask "alfred"
cask "font-meslo-lg-nerd-font"
cask "gimp"
cask "homebrew/cask-fonts/font-caskaydia-cove-nerd-font"
cask "homebrew/cask-fonts/font-inconsolata-nerd-font"
cask "homebrew/cask-fonts/font-iosevka-nerd-font"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "rectangle"
