# updated system packages
brew "bash"
brew "git"
brew "grep"
brew "less"
brew "ruby"
brew "vim"
brew "zsh"

# linters
brew "alexjs"
brew "efm-langserver"
brew "hadolint"
brew "languagetool"
brew "proselint"
brew "shellcheck"
brew "write-good"
brew "yamllint"

# extra packages
brew "bat"
brew "coreutils"
brew "fasd"
brew "fd"
brew "fnm"
brew "fzf"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "jq"
brew "lsd"
brew "neovim"
brew "railwaycat/emacsmacport/emacs-mac"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "zplug"

# casks
cask "alacritty"
cask "alfred"
cask "docker"
cask "gimp"
cask "homebrew/cask-fonts/font-caskaydia-cove-nerd-font"
cask "homebrew/cask-fonts/font-fira-code-nerd-font"
cask "homebrew/cask-fonts/font-fira-mono-nerd-font"
cask "homebrew/cask-fonts/font-hack-nerd-font"
cask "homebrew/cask-fonts/font-inconsolata-nerd-font"
cask "homebrew/cask-fonts/font-iosevka"
cask "homebrew/cask-fonts/font-iosevka-nerd-font"
cask "homebrew/cask-fonts/font-mononoki-nerd-font"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "rectangle"
